espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: HP SYS VER DATE REG */
/** Type of sys_ver_date register
 *  NA
 */
typedef union {
    struct {
        /** reg_ver_date : R/W; bitpos: [31:0]; default: 539165977;
         *  NA
         */
        uint32_t reg_ver_date:32;
    };
    uint32_t val;
} hp_sys_ver_date_reg_t;


/** Group: HP CLK EN REG */
/** Type of clk_en register
 *  NA
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_clk_en_reg_t;


/** Group: HP CPU INT FROM CPU 0 REG */
/** Type of cpu_int_from_cpu_0 register
 *  NA
 */
typedef union {
    struct {
        /** cpu_int_from_cpu_0 : R/W; bitpos: [0]; default: 0;
         *  set 1 will triger a interrupt
         */
        uint32_t cpu_int_from_cpu_0:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_cpu_int_from_cpu_0_reg_t;


/** Group: HP CPU INT FROM CPU 1 REG */
/** Type of cpu_int_from_cpu_1 register
 *  NA
 */
typedef union {
    struct {
        /** cpu_int_from_cpu_1 : R/W; bitpos: [0]; default: 0;
         *  set 1 will triger a interrupt
         */
        uint32_t cpu_int_from_cpu_1:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_cpu_int_from_cpu_1_reg_t;


/** Group: HP CPU INT FROM CPU 2 REG */
/** Type of cpu_int_from_cpu_2 register
 *  NA
 */
typedef union {
    struct {
        /** cpu_int_from_cpu_2 : R/W; bitpos: [0]; default: 0;
         *  set 1 will triger a interrupt
         */
        uint32_t cpu_int_from_cpu_2:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_cpu_int_from_cpu_2_reg_t;


/** Group: HP CPU INT FROM CPU 3 REG */
/** Type of cpu_int_from_cpu_3 register
 *  NA
 */
typedef union {
    struct {
        /** cpu_int_from_cpu_3 : R/W; bitpos: [0]; default: 0;
         *  set 1 will triger a interrupt
         */
        uint32_t cpu_int_from_cpu_3:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_cpu_int_from_cpu_3_reg_t;


/** Group: HP CACHE CLK CONFIG REG */
/** Type of cache_clk_config register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_cache_clk_on : R/W; bitpos: [0]; default: 1;
         *  l2 cahce clk enable
         */
        uint32_t reg_l2_cache_clk_on:1;
        /** reg_l1_d_cache_clk_on : R/W; bitpos: [1]; default: 1;
         *  l1 dcahce clk enable
         */
        uint32_t reg_l1_d_cache_clk_on:1;
        uint32_t reserved_2:2;
        /** reg_l1_i1_cache_clk_on : R/W; bitpos: [4]; default: 1;
         *  l1 icahce1 clk enable
         */
        uint32_t reg_l1_i1_cache_clk_on:1;
        /** reg_l1_i0_cache_clk_on : R/W; bitpos: [5]; default: 1;
         *  l1 icahce0 clk enable
         */
        uint32_t reg_l1_i0_cache_clk_on:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_cache_clk_config_reg_t;


/** Group: HP CACHE RESET CONFIG REG */
/** Type of cache_reset_config register
 *  NA
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** reg_l1_d_cache_reset : R/W; bitpos: [1]; default: 0;
         *  set 1 to reset l1 dcahce
         */
        uint32_t reg_l1_d_cache_reset:1;
        uint32_t reserved_2:2;
        /** reg_l1_i1_cache_reset : R/W; bitpos: [4]; default: 0;
         *  set 1 to reset l1 icahce1
         */
        uint32_t reg_l1_i1_cache_reset:1;
        /** reg_l1_i0_cache_reset : R/W; bitpos: [5]; default: 0;
         *  set 1 to reset l1 icahce0
         */
        uint32_t reg_l1_i0_cache_reset:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_cache_reset_config_reg_t;


/** Group: HP SYS DMA ADDR CTRL REG */
/** Type of sys_dma_addr_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_sys_dma_addr_sel : R/W; bitpos: [0]; default: 0;
         *  0 means dma access extmem use 8xxx_xxxx else use 4xxx_xxxx
         */
        uint32_t reg_sys_dma_addr_sel:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_dma_addr_ctrl_reg_t;


/** Group: HP TCM RAM WRR CONFIG REG */
/** Type of tcm_ram_wrr_config register
 *  NA
 */
typedef union {
    struct {
        /** reg_tcm_ram_ibus0_wt : R/W; bitpos: [2:0]; default: 7;
         *  weight value of ibus0
         */
        uint32_t reg_tcm_ram_ibus0_wt:3;
        /** reg_tcm_ram_ibus1_wt : R/W; bitpos: [5:3]; default: 7;
         *  weight value of ibus1
         */
        uint32_t reg_tcm_ram_ibus1_wt:3;
        /** reg_tcm_ram_ibus2_wt : R/W; bitpos: [8:6]; default: 4;
         *  weight value of ibus2
         */
        uint32_t reg_tcm_ram_ibus2_wt:3;
        /** reg_tcm_ram_ibus3_wt : R/W; bitpos: [11:9]; default: 4;
         *  weight value of ibus3
         */
        uint32_t reg_tcm_ram_ibus3_wt:3;
        /** reg_tcm_ram_dbus0_wt : R/W; bitpos: [14:12]; default: 5;
         *  weight value of dbus0
         */
        uint32_t reg_tcm_ram_dbus0_wt:3;
        /** reg_tcm_ram_dbus1_wt : R/W; bitpos: [17:15]; default: 5;
         *  weight value of dbus1
         */
        uint32_t reg_tcm_ram_dbus1_wt:3;
        /** reg_tcm_ram_dbus2_wt : R/W; bitpos: [20:18]; default: 3;
         *  weight value of dbus2
         */
        uint32_t reg_tcm_ram_dbus2_wt:3;
        /** reg_tcm_ram_dbus3_wt : R/W; bitpos: [23:21]; default: 3;
         *  weight value of dbus3
         */
        uint32_t reg_tcm_ram_dbus3_wt:3;
        /** reg_tcm_ram_dma_wt : R/W; bitpos: [26:24]; default: 2;
         *  weight value of dma
         */
        uint32_t reg_tcm_ram_dma_wt:3;
        uint32_t reserved_27:4;
        /** reg_tcm_ram_wrr_high : R/W; bitpos: [31]; default: 1;
         *  enable weighted round robin arbitration
         */
        uint32_t reg_tcm_ram_wrr_high:1;
    };
    uint32_t val;
} hp_tcm_ram_wrr_config_reg_t;


/** Group: HP TCM SW PARITY BWE MASK REG */
/** Type of tcm_sw_parity_bwe_mask register
 *  NA
 */
typedef union {
    struct {
        /** reg_tcm_sw_parity_bwe_mask_ctrl : R/W; bitpos: [0]; default: 0;
         *  Set 1 to mask tcm bwe parity code bit
         */
        uint32_t reg_tcm_sw_parity_bwe_mask_ctrl:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_tcm_sw_parity_bwe_mask_reg_t;


/** Group: HP TCM RAM PWR CTRL0 REG */
/** Type of tcm_ram_pwr_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_tcm_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  hp_tcm clk gatig force on
         */
        uint32_t reg_hp_tcm_clk_force_on:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_tcm_ram_pwr_ctrl0_reg_t;


/** Group: HP L2 ROM PWR CTRL0 REG */
/** Type of l2_rom_pwr_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_rom_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  l2_rom clk gating force on
         */
        uint32_t reg_l2_rom_clk_force_on:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_l2_rom_pwr_ctrl0_reg_t;


/** Group: HP PROBEA CTRL REG */
/** Type of probea_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_probe_a_mod_sel : R/W; bitpos: [15:0]; default: 0;
         *  Tihs field is used to selec probe_group from probe_group0 to probe_group15 for
         *  module's probe_out[31:0] in a mode
         */
        uint32_t reg_probe_a_mod_sel:16;
        /** reg_probe_a_top_sel : R/W; bitpos: [23:16]; default: 0;
         *  Tihs field is used to selec module's probe_out[31:0] as probe out in a mode
         */
        uint32_t reg_probe_a_top_sel:8;
        /** reg_probe_l_sel : R/W; bitpos: [25:24]; default: 0;
         *  Tihs field is used to selec probe_out[31:16]
         */
        uint32_t reg_probe_l_sel:2;
        /** reg_probe_h_sel : R/W; bitpos: [27:26]; default: 0;
         *  Tihs field is used to selec probe_out[31:16]
         */
        uint32_t reg_probe_h_sel:2;
        /** reg_probe_global_en : R/W; bitpos: [28]; default: 0;
         *  Set this bit to enable global debug probe in hp system.
         */
        uint32_t reg_probe_global_en:1;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} hp_probea_ctrl_reg_t;


