espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Group: HP PROBEB CTRL REG */
/** Type of probeb_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_probe_b_mod_sel : R/W; bitpos: [15:0]; default: 0;
         *  Tihs field is used to selec probe_group from probe_group0 to probe_group15 for
         *  module's probe_out[31:0] in b mode.
         */
        uint32_t reg_probe_b_mod_sel:16;
        /** reg_probe_b_top_sel : R/W; bitpos: [23:16]; default: 0;
         *  Tihs field is used to select module's probe_out[31:0]  as probe_out in b mode
         */
        uint32_t reg_probe_b_top_sel:8;
        /** reg_probe_b_en : R/W; bitpos: [24]; default: 0;
         *  Set this bit to enable b mode for debug probe. 1:  b mode, 0: a mode.
         */
        uint32_t reg_probe_b_en:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_probeb_ctrl_reg_t;


/** Group: HP PROBE OUT REG */
/** Type of probe_out register
 *  NA
 */
typedef union {
    struct {
        /** reg_probe_top_out : RO; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_probe_top_out:32;
    };
    uint32_t val;
} hp_probe_out_reg_t;


/** Group: HP L2 MEM RAM PWR CTRL0 REG */
/** Type of l2_mem_ram_pwr_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  l2ram clk_gating force on
         */
        uint32_t reg_l2_mem_clk_force_on:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_l2_mem_ram_pwr_ctrl0_reg_t;


/** Group: HP CPU CORESTALLED ST REG */
/** Type of cpu_corestalled_st register
 *  NA
 */
typedef union {
    struct {
        /** reg_core0_corestalled_st : RO; bitpos: [0]; default: 0;
         *  hp core0 corestalled status
         */
        uint32_t reg_core0_corestalled_st:1;
        /** reg_core1_corestalled_st : RO; bitpos: [1]; default: 0;
         *  hp core1 corestalled status
         */
        uint32_t reg_core1_corestalled_st:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_cpu_corestalled_st_reg_t;


/** Group: HP CRYPTO CTRL REG */
/** Type of crypto_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_enable_spi_manual_encrypt : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_enable_spi_manual_encrypt:1;
        /** reg_enable_download_db_encrypt : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_enable_download_db_encrypt:1;
        /** reg_enable_download_g0cb_decrypt : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_enable_download_g0cb_decrypt:1;
        /** reg_enable_download_manual_encrypt : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t reg_enable_download_manual_encrypt:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_crypto_ctrl_reg_t;


/** Group: HP GPIO O HOLD CTRL0 REG */
/** Type of gpio_o_hold_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_gpio_0_hold_low : R/W; bitpos: [31:0]; default: 0;
         *  hold control for gpio47~16
         */
        uint32_t reg_gpio_0_hold_low:32;
    };
    uint32_t val;
} hp_gpio_o_hold_ctrl0_reg_t;


/** Group: HP GPIO O HOLD CTRL1 REG */
/** Type of gpio_o_hold_ctrl1 register
 *  NA
 */
typedef union {
    struct {
        /** reg_gpio_0_hold_high : R/W; bitpos: [8:0]; default: 0;
         *  hold control for gpio56~48
         */
        uint32_t reg_gpio_0_hold_high:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_gpio_o_hold_ctrl1_reg_t;


/** Group: HP SYS RDN ECO CS REG */
/** Type of sys_rdn_eco_cs register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_sys_rdn_eco_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_hp_sys_rdn_eco_en:1;
        /** reg_hp_sys_rdn_eco_result : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_hp_sys_rdn_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_rdn_eco_cs_reg_t;


/** Group: HP CACHE APB POSTW EN REG */
/** Type of cache_apb_postw_en register
 *  NA
 */
typedef union {
    struct {
        /** reg_cache_apb_postw_en : R/W; bitpos: [0]; default: 0;
         *  cache apb register interface post write enable, 1 will speed up write, but will
         *  take some time to update value to register
         */
        uint32_t reg_cache_apb_postw_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_cache_apb_postw_en_reg_t;


/** Group: HP L2 MEM SUBSIZE REG */
/** Type of l2_mem_subsize register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_sub_blksize : R/W; bitpos: [1:0]; default: 0;
         *  l2mem sub block size 00=>32 01=>64 10=>128 11=>256
         */
        uint32_t reg_l2_mem_sub_blksize:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_l2_mem_subsize_reg_t;


/** Group: HP L2 MEM INT RAW REG */
/** Type of l2_mem_int_raw register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_ecc_err_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  intr triggered when two bit error detected and corrected from ecc
         */
        uint32_t reg_l2_mem_ecc_err_int_raw:1;
        /** reg_l2_mem_exceed_addr_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  intr triggered when access addr exceeds 0xff9ffff at bypass mode or exceeds
         *  0xff80000 at l2cache 128kb mode or exceeds 0xff60000 at l2cache 256kb mode
         */
        uint32_t reg_l2_mem_exceed_addr_int_raw:1;
        /** reg_l2_mem_err_resp_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  intr triggered when err response occurs
         */
        uint32_t reg_l2_mem_err_resp_int_raw:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_l2_mem_int_raw_reg_t;


/** Group: HP L2 MEM INT ST REG */
/** Type of l2_mem_int_st register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_ecc_err_int_st : RO; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_err_int_st:1;
        /** reg_l2_mem_exceed_addr_int_st : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_exceed_addr_int_st:1;
        /** reg_l2_mem_err_resp_int_st : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_err_resp_int_st:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_l2_mem_int_st_reg_t;


