espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Group: HP L2 MEM INT ENA REG */
/** Type of l2_mem_int_ena register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_ecc_err_int_ena : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_err_int_ena:1;
        /** reg_l2_mem_exceed_addr_int_ena : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_exceed_addr_int_ena:1;
        /** reg_l2_mem_err_resp_int_ena : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_err_resp_int_ena:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_l2_mem_int_ena_reg_t;


/** Group: HP L2 MEM INT CLR REG */
/** Type of l2_mem_int_clr register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_ecc_err_int_clr : WT; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_err_int_clr:1;
        /** reg_l2_mem_exceed_addr_int_clr : WT; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_exceed_addr_int_clr:1;
        /** reg_l2_mem_err_resp_int_clr : WT; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_err_resp_int_clr:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_l2_mem_int_clr_reg_t;


/** Group: HP L2 MEM L2 RAM ECC REG */
/** Type of l2_mem_l2_ram_ecc register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_ram_unit0_ecc_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_ram_unit0_ecc_en:1;
        /** reg_l2_ram_unit1_ecc_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_l2_ram_unit1_ecc_en:1;
        /** reg_l2_ram_unit2_ecc_en : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_l2_ram_unit2_ecc_en:1;
        /** reg_l2_ram_unit3_ecc_en : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t reg_l2_ram_unit3_ecc_en:1;
        /** reg_l2_ram_unit4_ecc_en : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t reg_l2_ram_unit4_ecc_en:1;
        /** reg_l2_ram_unit5_ecc_en : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t reg_l2_ram_unit5_ecc_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_l2_mem_l2_ram_ecc_reg_t;


/** Group: HP L2 MEM INT RECORD0 REG */
/** Type of l2_mem_int_record0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_exceed_addr_int_addr : RO; bitpos: [20:0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_exceed_addr_int_addr:21;
        /** reg_l2_mem_exceed_addr_int_we : RO; bitpos: [21]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_exceed_addr_int_we:1;
        /** reg_l2_mem_exceed_addr_int_master : RO; bitpos: [24:22]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_exceed_addr_int_master:3;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_l2_mem_int_record0_reg_t;


/** Group: HP L2 MEM INT RECORD1 REG */
/** Type of l2_mem_int_record1 register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_ecc_err_int_addr : RO; bitpos: [14:0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_err_int_addr:15;
        /** reg_l2_mem_ecc_one_bit_err : RO; bitpos: [15]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_one_bit_err:1;
        /** reg_l2_mem_ecc_two_bit_err : RO; bitpos: [16]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_two_bit_err:1;
        /** reg_l2_mem_ecc_err_bit : RO; bitpos: [25:17]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_ecc_err_bit:9;
        /** reg_l2_cache_err_bank : RO; bitpos: [26]; default: 0;
         *  NA
         */
        uint32_t reg_l2_cache_err_bank:1;
        uint32_t reserved_27:5;
    };
    uint32_t val;
} hp_l2_mem_int_record1_reg_t;


/** Group: HP L2 MEM L2 CACHE ECC REG */
/** Type of l2_mem_l2_cache_ecc register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_cache_ecc_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_cache_ecc_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_l2_mem_l2_cache_ecc_reg_t;


/** Group: HP L1CACHE BUS0 ID REG */
/** Type of l1cache_bus0_id register
 *  NA
 */
typedef union {
    struct {
        /** reg_l1_cache_bus0_id : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t reg_l1_cache_bus0_id:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_l1cache_bus0_id_reg_t;


/** Group: HP L1CACHE BUS1 ID REG */
/** Type of l1cache_bus1_id register
 *  NA
 */
typedef union {
    struct {
        /** reg_l1_cache_bus1_id : R/W; bitpos: [3:0]; default: 0;
         *  NA
         */
        uint32_t reg_l1_cache_bus1_id:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_l1cache_bus1_id_reg_t;


/** Group: HP L2 MEM RDN ECO CS REG */
/** Type of l2_mem_rdn_eco_cs register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_rdn_eco_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_rdn_eco_en:1;
        /** reg_l2_mem_rdn_eco_result : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_rdn_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_l2_mem_rdn_eco_cs_reg_t;


/** Group: HP L2 MEM RDN ECO LOW REG */
/** Type of l2_mem_rdn_eco_low register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_rdn_eco_low:32;
    };
    uint32_t val;
} hp_l2_mem_rdn_eco_low_reg_t;


/** Group: HP L2 MEM RDN ECO HIGH REG */
/** Type of l2_mem_rdn_eco_high register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  NA
         */
        uint32_t reg_l2_mem_rdn_eco_high:32;
    };
    uint32_t val;
} hp_l2_mem_rdn_eco_high_reg_t;


