espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Group: HP TCM RDN ECO CS REG */
/** Type of tcm_rdn_eco_cs register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_tcm_rdn_eco_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_hp_tcm_rdn_eco_en:1;
        /** reg_hp_tcm_rdn_eco_result : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_hp_tcm_rdn_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_tcm_rdn_eco_cs_reg_t;


/** Group: HP TCM RDN ECO LOW REG */
/** Type of tcm_rdn_eco_low register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_tcm_rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_hp_tcm_rdn_eco_low:32;
    };
    uint32_t val;
} hp_tcm_rdn_eco_low_reg_t;


/** Group: HP TCM RDN ECO HIGH REG */
/** Type of tcm_rdn_eco_high register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_tcm_rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  NA
         */
        uint32_t reg_hp_tcm_rdn_eco_high:32;
    };
    uint32_t val;
} hp_tcm_rdn_eco_high_reg_t;


/** Group: HP GPIO DED HOLD CTRL REG */
/** Type of gpio_ded_hold_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_gpio_ded_hold : R/W; bitpos: [25:0]; default: 0;
         *  hold control for gpio63~56
         */
        uint32_t reg_gpio_ded_hold:26;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} hp_gpio_ded_hold_ctrl_reg_t;


/** Group: HP L2 MEM SW ECC BWE MASK REG */
/** Type of l2_mem_sw_ecc_bwe_mask register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_sw_ecc_bwe_mask_ctrl : R/W; bitpos: [0]; default: 0;
         *  Set 1 to mask bwe hamming code bit
         */
        uint32_t reg_l2_mem_sw_ecc_bwe_mask_ctrl:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_l2_mem_sw_ecc_bwe_mask_reg_t;


/** Group: HP USB20OTG MEM CTRL REG */
/** Type of usb20otg_mem_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_usb20_mem_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_usb20_mem_clk_force_on:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_usb20otg_mem_ctrl_reg_t;


/** Group: configure_register */
/** Type of tcm_int_raw register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** tcm_parity_err_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t tcm_parity_err_int_raw:1;
    };
    uint32_t val;
} hp_tcm_int_raw_reg_t;

/** Type of tcm_int_st register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** tcm_parity_err_int_st : RO; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t tcm_parity_err_int_st:1;
    };
    uint32_t val;
} hp_tcm_int_st_reg_t;

/** Type of tcm_int_ena register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** tcm_parity_err_int_ena : R/W; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t tcm_parity_err_int_ena:1;
    };
    uint32_t val;
} hp_tcm_int_ena_reg_t;

/** Type of tcm_int_clr register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** tcm_parity_err_int_clr : WT; bitpos: [31]; default: 0;
         *  need_des
         */
        uint32_t tcm_parity_err_int_clr:1;
    };
    uint32_t val;
} hp_tcm_int_clr_reg_t;

/** Type of core_ahb_timeout register
 *  need_des
 */
typedef union {
    struct {
        /** core_ahb_timeout_en : R/W; bitpos: [0]; default: 1;
         *  set this field to 1 to enable hp core0&1 ahb timeout handle
         */
        uint32_t core_ahb_timeout_en:1;
        /** core_ahb_timeout_thres : R/W; bitpos: [16:1]; default: 65535;
         *  This field used to set hp core0&1 ahb bus timeout  threshold
         */
        uint32_t core_ahb_timeout_thres:16;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_core_ahb_timeout_reg_t;

/** Type of core_ibus_timeout register
 *  need_des
 */
typedef union {
    struct {
        /** core_ibus_timeout_en : R/W; bitpos: [0]; default: 1;
         *  set this field to 1 to enable hp core0&1 ibus timeout handle
         */
        uint32_t core_ibus_timeout_en:1;
        /** core_ibus_timeout_thres : R/W; bitpos: [16:1]; default: 65535;
         *  This field used to set hp core0&1 ibus timeout  threshold
         */
        uint32_t core_ibus_timeout_thres:16;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_core_ibus_timeout_reg_t;

/** Type of core_dbus_timeout register
 *  need_des
 */
typedef union {
    struct {
        /** core_dbus_timeout_en : R/W; bitpos: [0]; default: 1;
         *  set this field to 1 to enable hp core0&1 dbus timeout handle
         */
        uint32_t core_dbus_timeout_en:1;
        /** core_dbus_timeout_thres : R/W; bitpos: [16:1]; default: 65535;
         *  This field used to set hp core0&1 dbus timeout  threshold
         */
        uint32_t core_dbus_timeout_thres:16;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_core_dbus_timeout_reg_t;

/** Type of icm_cpu_h2x_cfg register
 *  need_des
 */
typedef union {
    struct {
        /** cpu_icm_h2x_post_wr_en : R/W; bitpos: [0]; default: 1;
         *  need_des
         */
        uint32_t cpu_icm_h2x_post_wr_en:1;
        /** cpu_icm_h2x_cut_through_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t cpu_icm_h2x_cut_through_en:1;
        /** cpu_icm_h2x_bridge_busy : RO; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t cpu_icm_h2x_bridge_busy:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_icm_cpu_h2x_cfg_reg_t;

/** Type of bitscrambler_peri_sel register
 *  Bitscrambler Peri Sel
 */
typedef union {
    struct {
        /** bitscrambler_peri_rx_sel : R/W; bitpos: [3:0]; default: 15;
         *  Set  this field to sel peri with DMA RX interface to connec with bitscrambler: 4'h0
         *  : lcd_cam, 4'h1: gpspi2, 4'h2: gpspi3, 4'h3: parl_io, 4'h4: aes, 4'h5: sha, 4'h6:
         *  adc, 4'h7: i2s0, 4'h8: i2s1, 4'h9: i2s2, 4'ha: i3c_mst, 4'hb: uhci0, 4'hc: RMT,
         *  else : none
         */
        uint32_t bitscrambler_peri_rx_sel:4;
        /** bitscrambler_peri_tx_sel : R/W; bitpos: [7:4]; default: 15;
         *  Set  this field to sel peri with DMA TX interface to connec with bitscrambler: 4'h0
         *  : lcd_cam, 4'h1: gpspi2, 4'h2: gpspi3, 4'h3: parl_io, 4'h4: aes, 4'h5: sha, 4'h6:
         *  adc, 4'h7: i2s0, 4'h8: i2s1, 4'h9: i2s2, 4'ha: i3c_mst, 4'hb: uhci0, 4'hc: RMT,
         *  else : none
         */
        uint32_t bitscrambler_peri_tx_sel:4;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_bitscrambler_peri_sel_reg_t;


/** Group: HP_TCM_PARITY_INT_RECORD_REG */
/** Type of tcm_parity_int_record register
 *  need_des
 */
typedef union {
    struct {
        /** tcm_parity_err_int_addr : RO; bitpos: [12:0]; default: 0;
         *  hp tcm_parity_err_addr
         */
        uint32_t tcm_parity_err_int_addr:13;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} hp_tcm_parity_int_record_reg_t;


/** Group: HP L1 CACHE PWR CTRL REG */
/** Type of l1_cache_pwr_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_l1_cache_mem_fo : R/W; bitpos: [5:0]; default: 0;
         *  need_des
         */
        uint32_t reg_l1_cache_mem_fo:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_l1_cache_pwr_ctrl_reg_t;


/** Group: HP L2 CACHE PWR CTRL REG */
/** Type of l2_cache_pwr_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_cache_mem_fo : R/W; bitpos: [1:0]; default: 0;
         *  need_des
         */
        uint32_t reg_l2_cache_mem_fo:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_l2_cache_pwr_ctrl_reg_t;


/** Group: Configuration Register */
/** Type of cpu_waiti_conf register
 *  CPU_WAITI configuration register
 */
typedef union {
    struct {
        /** cpu_wait_mode_force_on : R/W; bitpos: [0]; default: 1;
         *  Set 1 to force cpu_waiti_clk enable.
         */
        uint32_t cpu_wait_mode_force_on:1;
        /** cpu_waiti_delay_num : R/W; bitpos: [4:1]; default: 0;
         *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
         *  will close
         */
        uint32_t cpu_waiti_delay_num:4;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_cpu_waiti_conf_reg_t;

/** Type of sys_core_debug_runstall_conf register
 *  Core Debug runstall configure register
 */
typedef union {
    struct {
        /** sys_core_debug_runstall_enable : R/W; bitpos: [0]; default: 0;
         *  Set this field to 1 to enable debug runstall feature between HP-core and LP-core.
         */
        uint32_t sys_core_debug_runstall_enable:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_sys_core_debug_runstall_conf_reg_t;

/** Type of rsa_pd_ctrl register
 *  rsa pd ctrl register
 */
typedef union {
    struct {
        /** rsa_mem_force_pd : R/W; bitpos: [0]; default: 0;
         *  Set this bit to power down rsa internal memory.
         */
        uint32_t rsa_mem_force_pd:1;
        /** rsa_mem_force_pu : R/W; bitpos: [1]; default: 1;
         *  Set this bit to force power up rsa internal memory
         */
        uint32_t rsa_mem_force_pu:1;
        /** rsa_mem_pd : R/W; bitpos: [2]; default: 0;
         *  Set this bit to force power down rsa internal memory.
         */
        uint32_t rsa_mem_pd:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_rsa_pd_ctrl_reg_t;

