espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Type of ecc_pd_ctrl register
 *  ecc pd ctrl register
 */
typedef union {
    struct {
        /** ecc_mem_force_pd : R/W; bitpos: [0]; default: 0;
         *  Set this bit to power down ecc internal memory.
         */
        uint32_t ecc_mem_force_pd:1;
        /** ecc_mem_force_pu : R/W; bitpos: [1]; default: 1;
         *  Set this bit to force power up ecc internal memory
         */
        uint32_t ecc_mem_force_pu:1;
        /** ecc_mem_pd : R/W; bitpos: [2]; default: 0;
         *  Set this bit to force power down ecc internal memory.
         */
        uint32_t ecc_mem_pd:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_ecc_pd_ctrl_reg_t;

/** Type of rng_cfg register
 *  rng cfg register
 */
typedef union {
    struct {
        /** rng_sample_enable : R/W; bitpos: [0]; default: 0;
         *  enable rng sample chain
         */
        uint32_t rng_sample_enable:1;
        uint32_t reserved_1:15;
        /** rng_chain_clk_div_num : R/W; bitpos: [23:16]; default: 0;
         *  chain clk div num to pad for debug
         */
        uint32_t rng_chain_clk_div_num:8;
        /** rng_sample_cnt : RO; bitpos: [31:24]; default: 0;
         *  debug rng sample cnt
         */
        uint32_t rng_sample_cnt:8;
    };
    uint32_t val;
} hp_rng_cfg_reg_t;

/** Type of uart_pd_ctrl register
 *  ecc pd ctrl register
 */
typedef union {
    struct {
        /** uart_mem_force_pd : R/W; bitpos: [0]; default: 0;
         *  Set this bit to power down hp uart internal memory.
         */
        uint32_t uart_mem_force_pd:1;
        /** uart_mem_force_pu : R/W; bitpos: [1]; default: 1;
         *  Set this bit to force power up hp uart  internal memory
         */
        uint32_t uart_mem_force_pu:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_uart_pd_ctrl_reg_t;

/** Type of peri_mem_clk_force_on register
 *  hp peri mem clk force on regpster
 */
typedef union {
    struct {
        /** rmt_mem_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  Set this bit to force on mem clk in rmt
         */
        uint32_t rmt_mem_clk_force_on:1;
        /** bitscrambler_tx_mem_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  Set this bit to force on tx mem clk in bitscrambler
         */
        uint32_t bitscrambler_tx_mem_clk_force_on:1;
        /** bitscrambler_rx_mem_clk_force_on : R/W; bitpos: [2]; default: 0;
         *  Set this bit to force on rx mem clk in bitscrambler
         */
        uint32_t bitscrambler_rx_mem_clk_force_on:1;
        /** gdma_mem_clk_force_on : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force on mem clk in gdma
         */
        uint32_t gdma_mem_clk_force_on:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_peri_mem_clk_force_on_reg_t;


/** Group: HP PERI1 APB POSTW EN REG */
/** Type of peri1_apb_postw_en register
 *  NA
 */
typedef union {
    struct {
        /** peri1_apb_postw_en : R/W; bitpos: [0]; default: 0;
         *  hp_peri1 apb register interface post write enable, 1 will speed up write, but will
         *  take some time to update value to register
         */
        uint32_t peri1_apb_postw_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_peri1_apb_postw_en_reg_t;


/** Group: APB Sync Register */
/** Type of sys_apb_sync_postw_en register
 *  N/A
 */
typedef union {
    struct {
        /** sys_gmac_apb_postw_en : R/W; bitpos: [0]; default: 0;
         *  N/A
         */
        uint32_t sys_gmac_apb_postw_en:1;
        /** sys_dsi_host_apb_postw_en : R/W; bitpos: [1]; default: 0;
         *  N/A
         */
        uint32_t sys_dsi_host_apb_postw_en:1;
        /** sys_csi_host_apb_sync_postw_en : R/W; bitpos: [2]; default: 0;
         *  N/A
         */
        uint32_t sys_csi_host_apb_sync_postw_en:1;
        /** sys_csi_host_apb_async_postw_en : R/W; bitpos: [3]; default: 0;
         *  N/A
         */
        uint32_t sys_csi_host_apb_async_postw_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_sys_apb_sync_postw_en_reg_t;


/** Group: GDMA Ctonrol Register */
/** Type of sys_gdma_ctrl register
 *  N/A
 */
typedef union {
    struct {
        /** sys_debug_ch_num : R/W; bitpos: [1:0]; default: 0;
         *  N/A
         */
        uint32_t sys_debug_ch_num:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_sys_gdma_ctrl_reg_t;


/** Group: GMAC Control Register */
/** Type of sys_gmac_ctrl0 register
 *  N/A
 */
typedef union {
    struct {
        /** sys_ptp_pps : RO; bitpos: [0]; default: 0;
         *  N/A
         */
        uint32_t sys_ptp_pps:1;
        /** sys_sbd_flowctrl : R/W; bitpos: [1]; default: 0;
         *  N/A
         */
        uint32_t sys_sbd_flowctrl:1;
        /** sys_phy_intf_sel : R/W; bitpos: [4:2]; default: 0;
         *  N/A
         */
        uint32_t sys_phy_intf_sel:3;
        /** sys_gmac_mem_clk_force_on : R/W; bitpos: [5]; default: 0;
         *  N/A
         */
        uint32_t sys_gmac_mem_clk_force_on:1;
        /** sys_gmac_rst_clk_tx_n : RO; bitpos: [6]; default: 0;
         *  N/A
         */
        uint32_t sys_gmac_rst_clk_tx_n:1;
        /** sys_gmac_rst_clk_rx_n : RO; bitpos: [7]; default: 0;
         *  N/A
         */
        uint32_t sys_gmac_rst_clk_rx_n:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_sys_gmac_ctrl0_reg_t;

/** Type of sys_gmac_ctrl1 register
 *  N/A
 */
typedef union {
    struct {
        /** sys_ptp_timestamp_l : RO; bitpos: [31:0]; default: 0;
         *  N/A
         */
        uint32_t sys_ptp_timestamp_l:32;
    };
    uint32_t val;
} hp_sys_gmac_ctrl1_reg_t;

/** Type of sys_gmac_ctrl2 register
 *  N/A
 */
typedef union {
    struct {
        /** sys_ptp_timestamp_h : RO; bitpos: [31:0]; default: 0;
         *  N/A
         */
        uint32_t sys_ptp_timestamp_h:32;
    };
    uint32_t val;
} hp_sys_gmac_ctrl2_reg_t;


/** Group: VPU Control Register */
/** Type of sys_vpu_ctrl register
 *  N/A
 */
typedef union {
    struct {
        /** sys_ppa_lslp_mem_pd : R/W; bitpos: [0]; default: 0;
         *  N/A
         */
        uint32_t sys_ppa_lslp_mem_pd:1;
        /** sys_jpeg_sdslp_mem_pd : R/W; bitpos: [1]; default: 0;
         *  N/A
         */
        uint32_t sys_jpeg_sdslp_mem_pd:1;
        /** sys_jpeg_lslp_mem_pd : R/W; bitpos: [2]; default: 0;
         *  N/A
         */
        uint32_t sys_jpeg_lslp_mem_pd:1;
        /** sys_jpeg_dslp_mem_pd : R/W; bitpos: [3]; default: 0;
         *  N/A
         */
        uint32_t sys_jpeg_dslp_mem_pd:1;
        /** sys_dma2d_lslp_mem_pd : R/W; bitpos: [4]; default: 0;
         *  N/A
         */
        uint32_t sys_dma2d_lslp_mem_pd:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_sys_vpu_ctrl_reg_t;


