espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Group: USB OTG20 Control Register */
/** Type of sys_usbotg20_ctrl register
 *  N/A
 */
typedef union {
    struct {
        /** sys_otg_phy_test_done : RO; bitpos: [0]; default: 0;
         *  N/A
         */
        uint32_t sys_otg_phy_test_done:1;
        /** sys_usb_mem_aux_ctrl : R/W; bitpos: [14:1]; default: 4896;
         *  N/A
         */
        uint32_t sys_usb_mem_aux_ctrl:14;
        /** sys_phy_suspendm : R/W; bitpos: [15]; default: 0;
         *  N/A
         */
        uint32_t sys_phy_suspendm:1;
        /** sys_phy_suspend_force_en : R/W; bitpos: [16]; default: 0;
         *  N/A
         */
        uint32_t sys_phy_suspend_force_en:1;
        /** sys_phy_rstn : R/W; bitpos: [17]; default: 1;
         *  N/A
         */
        uint32_t sys_phy_rstn:1;
        /** sys_phy_reset_force_en : R/W; bitpos: [18]; default: 0;
         *  N/A
         */
        uint32_t sys_phy_reset_force_en:1;
        /** sys_phy_pll_force_en : R/W; bitpos: [19]; default: 0;
         *  N/A
         */
        uint32_t sys_phy_pll_force_en:1;
        /** sys_phy_pll_en : R/W; bitpos: [20]; default: 0;
         *  N/A
         */
        uint32_t sys_phy_pll_en:1;
        /** sys_otg_suspendm : R/W; bitpos: [21]; default: 0;
         *  N/A
         */
        uint32_t sys_otg_suspendm:1;
        /** sys_otg_phy_txbitstuff_en : R/W; bitpos: [22]; default: 0;
         *  N/A
         */
        uint32_t sys_otg_phy_txbitstuff_en:1;
        /** sys_otg_phy_refclk_mode : R/W; bitpos: [23]; default: 1;
         *  N/A
         */
        uint32_t sys_otg_phy_refclk_mode:1;
        /** sys_otg_phy_bisten : R/W; bitpos: [24]; default: 0;
         *  N/A
         */
        uint32_t sys_otg_phy_bisten:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} hp_sys_usbotg20_ctrl_reg_t;


/** Group: HP_TCM_ERR_RESP_CTRL_REG */
/** Type of tcm_err_resp_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** tcm_err_resp_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to turn on tcm error response
         */
        uint32_t tcm_err_resp_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_tcm_err_resp_ctrl_reg_t;


/** Group: HP L2 MEM REFRESH REG */
/** Type of l2_mem_refresh register
 *  NA
 */
typedef union {
    struct {
        /** reg_l2_mem_unit0_refersh_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit0_refersh_en:1;
        /** reg_l2_mem_unit1_refersh_en : R/W; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit1_refersh_en:1;
        /** reg_l2_mem_unit2_refersh_en : R/W; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit2_refersh_en:1;
        /** reg_l2_mem_unit3_refersh_en : R/W; bitpos: [3]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit3_refersh_en:1;
        /** reg_l2_mem_unit4_refersh_en : R/W; bitpos: [4]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit4_refersh_en:1;
        /** reg_l2_mem_unit5_refersh_en : R/W; bitpos: [5]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit5_refersh_en:1;
        /** reg_l2_mem_refersh_cnt_reset : R/W; bitpos: [6]; default: 1;
         *  Set 1 to reset l2mem_refresh_cnt
         */
        uint32_t reg_l2_mem_refersh_cnt_reset:1;
        /** reg_l2_mem_unit0_refresh_done : RO; bitpos: [7]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit0_refresh_done:1;
        /** reg_l2_mem_unit1_refresh_done : RO; bitpos: [8]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit1_refresh_done:1;
        /** reg_l2_mem_unit2_refresh_done : RO; bitpos: [9]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit2_refresh_done:1;
        /** reg_l2_mem_unit3_refresh_done : RO; bitpos: [10]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit3_refresh_done:1;
        /** reg_l2_mem_unit4_refresh_done : RO; bitpos: [11]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit4_refresh_done:1;
        /** reg_l2_mem_unit5_refresh_done : RO; bitpos: [12]; default: 0;
         *  NA
         */
        uint32_t reg_l2_mem_unit5_refresh_done:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} hp_l2_mem_refresh_reg_t;


/** Group: HP TCM INIT REG */
/** Type of tcm_init register
 *  NA
 */
typedef union {
    struct {
        /** reg_tcm_init_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_tcm_init_en:1;
        /** reg_tcm_init_cnt_reset : R/W; bitpos: [1]; default: 1;
         *  Set 1 to reset tcm init cnt
         */
        uint32_t reg_tcm_init_cnt_reset:1;
        /** reg_tcm_init_done : RO; bitpos: [2]; default: 0;
         *  NA
         */
        uint32_t reg_tcm_init_done:1;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_tcm_init_reg_t;


/** Group: HP_TCM_PARITY_CHECK_CTRL_REG */
/** Type of tcm_parity_check_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** tcm_parity_check_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to turn on tcm parity check
         */
        uint32_t tcm_parity_check_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_tcm_parity_check_ctrl_reg_t;


/** Group: HP_DESIGN_FOR_VERIFICATION0 */
/** Type of design_for_verification0 register
 *  need_des
 */
typedef union {
    struct {
        /** dfv0 : R/W; bitpos: [31:0]; default: 0;
         *  register for DV
         */
        uint32_t dfv0:32;
    };
    uint32_t val;
} hp_design_for_verification0_reg_t;


/** Group: HP_DESIGN_FOR_VERIFICATION1 */
/** Type of design_for_verification1 register
 *  need_des
 */
typedef union {
    struct {
        /** dfv1 : R/W; bitpos: [31:0]; default: 0;
         *  register for DV
         */
        uint32_t dfv1:32;
    };
    uint32_t val;
} hp_design_for_verification1_reg_t;


/** Group: HP_PSRAM_FLASH_ADDR_INTERCHANGE */
/** Type of psram_flash_addr_interchange register
 *  need_des
 */
typedef union {
    struct {
        /** psram_flash_addr_interchange_cpu : R/W; bitpos: [0]; default: 0;
         *  Set 1 to enable addr interchange between psram and flash in axi matrix when hp cpu
         *  access through cache
         */
        uint32_t psram_flash_addr_interchange_cpu:1;
        /** psram_flash_addr_interchange_dma : R/W; bitpos: [1]; default: 0;
         *  Set 1 to enable addr interchange between psram and flash in axi matrix when dma
         *  device access, lp core access and hp core access through ahb
         */
        uint32_t psram_flash_addr_interchange_dma:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_psram_flash_addr_interchange_reg_t;


/** Group: Interrupt Registers */
/** Type of ahb2axi_bresp_err_int_raw register
 *  NA
 */
typedef union {
    struct {
        /** cpu_icm_h2x_bresp_err_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in
         *  post write mode in ahb2axi.
         */
        uint32_t cpu_icm_h2x_bresp_err_int_raw:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_ahb2axi_bresp_err_int_raw_reg_t;

/** Type of ahb2axi_bresp_err_int_st register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** cpu_icm_h2x_bresp_err_int_st : RO; bitpos: [31]; default: 0;
         *  the masked interrupt status of  cpu_icm_h2x_bresp_err
         */
        uint32_t cpu_icm_h2x_bresp_err_int_st:1;
    };
    uint32_t val;
} hp_ahb2axi_bresp_err_int_st_reg_t;

/** Type of ahb2axi_bresp_err_int_ena register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** cpu_icm_h2x_bresp_err_int_ena : R/W; bitpos: [31]; default: 0;
         *  Write 1 to enable cpu_icm_h2x_bresp_err int
         */
        uint32_t cpu_icm_h2x_bresp_err_int_ena:1;
    };
    uint32_t val;
} hp_ahb2axi_bresp_err_int_ena_reg_t;

