espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Type of ahb2axi_bresp_err_int_clr register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:31;
        /** cpu_icm_h2x_bresp_err_int_clr : WT; bitpos: [31]; default: 0;
         *  Write 1 to clear cpu_icm_h2x_bresp_err  int
         */
        uint32_t cpu_icm_h2x_bresp_err_int_clr:1;
    };
    uint32_t val;
} hp_ahb2axi_bresp_err_int_clr_reg_t;

/** Type of core_timeout_int_raw register
 *  Hp core bus timeout interrupt raw register
 */
typedef union {
    struct {
        /** core0_ahb_timeout_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  the raw interrupt status of hp core0  ahb timeout
         */
        uint32_t core0_ahb_timeout_int_raw:1;
        /** core1_ahb_timeout_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  the raw interrupt status of hp core1  ahb timeout
         */
        uint32_t core1_ahb_timeout_int_raw:1;
        /** core0_ibus_timeout_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  the raw interrupt status of hp core0  ibus timeout
         */
        uint32_t core0_ibus_timeout_int_raw:1;
        /** core1_ibus_timeout_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  the raw interrupt status of hp core1  ibus timeout
         */
        uint32_t core1_ibus_timeout_int_raw:1;
        /** core0_dbus_timeout_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  the raw interrupt status of hp core0  dbus timeout
         */
        uint32_t core0_dbus_timeout_int_raw:1;
        /** core1_dbus_timeout_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  the raw interrupt status of hp core1  dbus timeout
         */
        uint32_t core1_dbus_timeout_int_raw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_core_timeout_int_raw_reg_t;

/** Type of core_timeout_int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** core0_ahb_timeout_int_st : RO; bitpos: [0]; default: 0;
         *  the masked interrupt status of hp core0  ahb timeout
         */
        uint32_t core0_ahb_timeout_int_st:1;
        /** core1_ahb_timeout_int_st : RO; bitpos: [1]; default: 0;
         *  the masked interrupt status of hp core1  ahb timeout
         */
        uint32_t core1_ahb_timeout_int_st:1;
        /** core0_ibus_timeout_int_st : RO; bitpos: [2]; default: 0;
         *  the masked interrupt status of hp core0  ibus timeout
         */
        uint32_t core0_ibus_timeout_int_st:1;
        /** core1_ibus_timeout_int_st : RO; bitpos: [3]; default: 0;
         *  the masked interrupt status of hp core1  ibus timeout
         */
        uint32_t core1_ibus_timeout_int_st:1;
        /** core0_dbus_timeout_int_st : RO; bitpos: [4]; default: 0;
         *  the masked interrupt status of hp core0  dbus timeout
         */
        uint32_t core0_dbus_timeout_int_st:1;
        /** core1_dbus_timeout_int_st : RO; bitpos: [5]; default: 0;
         *  the masked interrupt status of hp core1  dbus timeout
         */
        uint32_t core1_dbus_timeout_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_core_timeout_int_st_reg_t;

/** Type of core_timeout_int_ena register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** core0_ahb_timeout_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable hp_core0_ahb_timeout int
         */
        uint32_t core0_ahb_timeout_int_ena:1;
        /** core1_ahb_timeout_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable hp_core1_ahb_timeout int
         */
        uint32_t core1_ahb_timeout_int_ena:1;
        /** core0_ibus_timeout_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable hp_core0_ibus_timeout int
         */
        uint32_t core0_ibus_timeout_int_ena:1;
        /** core1_ibus_timeout_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable hp_core1_ibus_timeout int
         */
        uint32_t core1_ibus_timeout_int_ena:1;
        /** core0_dbus_timeout_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable hp_core0_dbus_timeout int
         */
        uint32_t core0_dbus_timeout_int_ena:1;
        /** core1_dbus_timeout_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable hp_core1_dbus_timeout int
         */
        uint32_t core1_dbus_timeout_int_ena:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_core_timeout_int_ena_reg_t;

/** Type of core_timeout_int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        /** core0_ahb_timeout_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clear hp_core0_ahb_timeout int
         */
        uint32_t core0_ahb_timeout_int_clr:1;
        /** core1_ahb_timeout_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clear hp_core1_ahb_timeout int
         */
        uint32_t core1_ahb_timeout_int_clr:1;
        /** core0_ibus_timeout_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear hp_core0_ibus_timeout int
         */
        uint32_t core0_ibus_timeout_int_clr:1;
        /** core1_ibus_timeout_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear hp_core1_ibus_timeout int
         */
        uint32_t core1_ibus_timeout_int_clr:1;
        /** core0_dbus_timeout_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear hp_core0_dbus_timeout int
         */
        uint32_t core0_dbus_timeout_int_clr:1;
        /** core1_dbus_timeout_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear hp_core1_dbus_timeout int
         */
        uint32_t core1_dbus_timeout_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_core_timeout_int_clr_reg_t;


/** Group: HP_L2_MEM_ERR_RESP_CTRL_REG */
/** Type of l2_mem_err_resp_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** l2_mem_err_resp_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to turn on l2mem error response
         */
        uint32_t l2_mem_err_resp_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_l2_mem_err_resp_ctrl_reg_t;


/** Group: HP_L2_MEM_AHB_BUFFER_CTRL_REG */
/** Type of l2_mem_ahb_buffer_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** l2_mem_ahb_wrbuffer_en : R/W; bitpos: [0]; default: 0;
         *  Set 1 to turn on l2mem ahb wr buffer
         */
        uint32_t l2_mem_ahb_wrbuffer_en:1;
        /** l2_mem_ahb_rdbuffer_en : R/W; bitpos: [1]; default: 0;
         *  Set 1 to turn on l2mem ahb rd buffer
         */
        uint32_t l2_mem_ahb_rdbuffer_en:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_l2_mem_ahb_buffer_ctrl_reg_t;


