espressif/esp-idf/components/soc/esp32p4/include/soc/hp_system_struct.h
/** Group: HP_CORE_DMACTIVE_LPCORE_REG */
/** Type of core_dmactive_lpcore register
 *  need_des
 */
typedef union {
    struct {
        /** core_dmactive_lpcore : RO; bitpos: [0]; default: 0;
         *  hp core dmactive_lpcore value
         */
        uint32_t core_dmactive_lpcore:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_core_dmactive_lpcore_reg_t;


/** Group: control registers */
/** Type of core_err_resp_dis register
 *  need_des
 */
typedef union {
    struct {
        /** core_err_resp_dis : R/W; bitpos: [2:0]; default: 0;
         *  Set bit0 to disable ibus err resp. Set bit1 to disable dbus err resp.  Set bit 2 to
         *  disable ahb err resp.
         */
        uint32_t core_err_resp_dis:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_core_err_resp_dis_reg_t;


/** Group: HP GPIO O HYS CTRL0 REG */
/** Type of gpio_o_hys_ctrl0 register
 *  NA
 */
typedef union {
    struct {
        /** reg_gpio_0_hys_low : R/W; bitpos: [31:0]; default: 0;
         *  hys control for gpio47~16
         */
        uint32_t reg_gpio_0_hys_low:32;
    };
    uint32_t val;
} hp_gpio_o_hys_ctrl0_reg_t;


/** Group: HP GPIO O HYS CTRL1 REG */
/** Type of gpio_o_hys_ctrl1 register
 *  NA
 */
typedef union {
    struct {
        /** reg_gpio_0_hys_high : R/W; bitpos: [8:0]; default: 0;
         *  hys control for gpio56~48
         */
        uint32_t reg_gpio_0_hys_high:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_gpio_o_hys_ctrl1_reg_t;


typedef struct {
    volatile hp_sys_ver_date_reg_t sys_ver_date;
    volatile hp_clk_en_reg_t clk_en;
    uint32_t reserved_008[2];
    volatile hp_cpu_int_from_cpu_0_reg_t cpu_int_from_cpu_0;
    volatile hp_cpu_int_from_cpu_1_reg_t cpu_int_from_cpu_1;
    volatile hp_cpu_int_from_cpu_2_reg_t cpu_int_from_cpu_2;
    volatile hp_cpu_int_from_cpu_3_reg_t cpu_int_from_cpu_3;
    volatile hp_cache_clk_config_reg_t cache_clk_config;
    volatile hp_cache_reset_config_reg_t cache_reset_config;
    uint32_t reserved_028;
    volatile hp_sys_dma_addr_ctrl_reg_t sys_dma_addr_ctrl;
    uint32_t reserved_030;
    volatile hp_tcm_ram_wrr_config_reg_t tcm_ram_wrr_config;
    volatile hp_tcm_sw_parity_bwe_mask_reg_t tcm_sw_parity_bwe_mask;
    volatile hp_tcm_ram_pwr_ctrl0_reg_t tcm_ram_pwr_ctrl0;
    volatile hp_l2_rom_pwr_ctrl0_reg_t l2_rom_pwr_ctrl0;
    uint32_t reserved_044[3];
    volatile hp_probea_ctrl_reg_t probea_ctrl;
    volatile hp_probeb_ctrl_reg_t probeb_ctrl;
    uint32_t reserved_058;
    volatile hp_probe_out_reg_t probe_out;
    volatile hp_l2_mem_ram_pwr_ctrl0_reg_t l2_mem_ram_pwr_ctrl0;
    volatile hp_cpu_corestalled_st_reg_t cpu_corestalled_st;
    uint32_t reserved_068[2];
    volatile hp_crypto_ctrl_reg_t crypto_ctrl;
    volatile hp_gpio_o_hold_ctrl0_reg_t gpio_o_hold_ctrl0;
    volatile hp_gpio_o_hold_ctrl1_reg_t gpio_o_hold_ctrl1;
    volatile hp_sys_rdn_eco_cs_reg_t sys_rdn_eco_cs;
    volatile hp_cache_apb_postw_en_reg_t cache_apb_postw_en;
    volatile hp_l2_mem_subsize_reg_t l2_mem_subsize;
    uint32_t reserved_088[5];
    volatile hp_l2_mem_int_raw_reg_t l2_mem_int_raw;
    volatile hp_l2_mem_int_st_reg_t l2_mem_int_st;
    volatile hp_l2_mem_int_ena_reg_t l2_mem_int_ena;
    volatile hp_l2_mem_int_clr_reg_t l2_mem_int_clr;
    volatile hp_l2_mem_l2_ram_ecc_reg_t l2_mem_l2_ram_ecc;
    volatile hp_l2_mem_int_record0_reg_t l2_mem_int_record0;
    volatile hp_l2_mem_int_record1_reg_t l2_mem_int_record1;
    uint32_t reserved_0b8[3];
    volatile hp_l2_mem_l2_cache_ecc_reg_t l2_mem_l2_cache_ecc;
    volatile hp_l1cache_bus0_id_reg_t l1cache_bus0_id;
    volatile hp_l1cache_bus1_id_reg_t l1cache_bus1_id;
    uint32_t reserved_0d0[2];
    volatile hp_l2_mem_rdn_eco_cs_reg_t l2_mem_rdn_eco_cs;
    volatile hp_l2_mem_rdn_eco_low_reg_t l2_mem_rdn_eco_low;
    volatile hp_l2_mem_rdn_eco_high_reg_t l2_mem_rdn_eco_high;
    volatile hp_tcm_rdn_eco_cs_reg_t tcm_rdn_eco_cs;
    volatile hp_tcm_rdn_eco_low_reg_t tcm_rdn_eco_low;
    volatile hp_tcm_rdn_eco_high_reg_t tcm_rdn_eco_high;
    volatile hp_gpio_ded_hold_ctrl_reg_t gpio_ded_hold_ctrl;
    volatile hp_l2_mem_sw_ecc_bwe_mask_reg_t l2_mem_sw_ecc_bwe_mask;
    volatile hp_usb20otg_mem_ctrl_reg_t usb20otg_mem_ctrl;
    volatile hp_tcm_int_raw_reg_t tcm_int_raw;
    volatile hp_tcm_int_st_reg_t tcm_int_st;
    volatile hp_tcm_int_ena_reg_t tcm_int_ena;
    volatile hp_tcm_int_clr_reg_t tcm_int_clr;
    volatile hp_tcm_parity_int_record_reg_t tcm_parity_int_record;
    volatile hp_l1_cache_pwr_ctrl_reg_t l1_cache_pwr_ctrl;
    volatile hp_l2_cache_pwr_ctrl_reg_t l2_cache_pwr_ctrl;
    volatile hp_cpu_waiti_conf_reg_t cpu_waiti_conf;
    volatile hp_sys_core_debug_runstall_conf_reg_t sys_core_debug_runstall_conf;
    volatile hp_core_ahb_timeout_reg_t core_ahb_timeout;
    volatile hp_core_ibus_timeout_reg_t core_ibus_timeout;
    volatile hp_core_dbus_timeout_reg_t core_dbus_timeout;
    uint32_t reserved_12c[3];
    volatile hp_icm_cpu_h2x_cfg_reg_t icm_cpu_h2x_cfg;
    volatile hp_peri1_apb_postw_en_reg_t peri1_apb_postw_en;
    volatile hp_bitscrambler_peri_sel_reg_t bitscrambler_peri_sel;
    volatile hp_sys_apb_sync_postw_en_reg_t sys_apb_sync_postw_en;
    volatile hp_sys_gdma_ctrl_reg_t sys_gdma_ctrl;
    volatile hp_sys_gmac_ctrl0_reg_t sys_gmac_ctrl0;
    volatile hp_sys_gmac_ctrl1_reg_t sys_gmac_ctrl1;
    volatile hp_sys_gmac_ctrl2_reg_t sys_gmac_ctrl2;
    volatile hp_sys_vpu_ctrl_reg_t sys_vpu_ctrl;
    volatile hp_sys_usbotg20_ctrl_reg_t sys_usbotg20_ctrl;
    volatile hp_tcm_err_resp_ctrl_reg_t tcm_err_resp_ctrl;
    volatile hp_l2_mem_refresh_reg_t l2_mem_refresh;
    volatile hp_tcm_init_reg_t tcm_init;
    volatile hp_tcm_parity_check_ctrl_reg_t tcm_parity_check_ctrl;
    volatile hp_design_for_verification0_reg_t design_for_verification0;
    volatile hp_design_for_verification1_reg_t design_for_verification1;
    uint32_t reserved_178[2];
    volatile hp_psram_flash_addr_interchange_reg_t psram_flash_addr_interchange;
    uint32_t reserved_184;
    volatile hp_ahb2axi_bresp_err_int_raw_reg_t ahb2axi_bresp_err_int_raw;
    volatile hp_ahb2axi_bresp_err_int_st_reg_t ahb2axi_bresp_err_int_st;
    volatile hp_ahb2axi_bresp_err_int_ena_reg_t ahb2axi_bresp_err_int_ena;
    volatile hp_ahb2axi_bresp_err_int_clr_reg_t ahb2axi_bresp_err_int_clr;
    volatile hp_l2_mem_err_resp_ctrl_reg_t l2_mem_err_resp_ctrl;
    volatile hp_l2_mem_ahb_buffer_ctrl_reg_t l2_mem_ahb_buffer_ctrl;
    volatile hp_core_dmactive_lpcore_reg_t core_dmactive_lpcore;
    volatile hp_core_err_resp_dis_reg_t core_err_resp_dis;
    volatile hp_core_timeout_int_raw_reg_t core_timeout_int_raw;
    volatile hp_core_timeout_int_st_reg_t core_timeout_int_st;
    volatile hp_core_timeout_int_ena_reg_t core_timeout_int_ena;
    volatile hp_core_timeout_int_clr_reg_t core_timeout_int_clr;
    uint32_t reserved_1b8[2];
    volatile hp_gpio_o_hys_ctrl0_reg_t gpio_o_hys_ctrl0;
    volatile hp_gpio_o_hys_ctrl1_reg_t gpio_o_hys_ctrl1;
    uint32_t reserved_1c8[2];
    volatile hp_rsa_pd_ctrl_reg_t rsa_pd_ctrl;
    volatile hp_ecc_pd_ctrl_reg_t ecc_pd_ctrl;
    volatile hp_rng_cfg_reg_t rng_cfg;
    volatile hp_uart_pd_ctrl_reg_t uart_pd_ctrl;
    volatile hp_peri_mem_clk_force_on_reg_t peri_mem_clk_force_on;
} hp_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(hp_dev_t) == 0x1e4, "Invalid size of hp_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
